pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_bootloader_specification_semantics.h
//---------------------------------------------------------------------------*
//                                                                           *
//            File 'pic18_bootloader_specification_semantics.h'              *
//                        Generated by version 2.5.0                         *
//                     october 9th, 2013, at 15h15'35"                       *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_bootloader_specification_semantics_ENTITIES_DEFINED
#define pic18_bootloader_specification_semantics_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_semantics.h"
#include "piccolo_config.h"
#include "piccoloDevice_semantics.h"
#include "generic_metamodel.h"
#include "ram_sections.h"
#include "ipic18_build_block_representation.h"
#include "ipic18_optimize_block.h"
#include "ipic18_display_block_list.h"
#include "ipic18_block_representation.h"
#include "pic18_metamodel.h"
#include "ipic18_regular_instructions.h"
#include "pic18_mnemonics.h"
#include "ipic18_terminators.h"
#include "intermediate_generic.h"
#include "ipic18_block_ordering.h"
#include "ipic18_cluster_ordering.h"
#include "ipic18_relatives_resolution.h"
#include "ipic18_code_generation.h"
#include "pic18_used_routines.h"
#include "piccolo_embedded_devices.h"
#include "pic18_routine_inlining.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*
//                                                                           *
//              Routine 'pic18BootloaderSpecificationAnalysis'               *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_pic_31__38_BootloaderSpecificationAnalysis (const GALGAS_string constinArgument0,
                                                         const GALGAS_lstring constinArgument1,
                                                         const GALGAS_lstring constinArgument2,
                                                         const GALGAS_routineDeclarationList constinArgument3,
                                                         const GALGAS_bootloaderReservedRAMmap constinArgument4,
                                                         const GALGAS_luint constinArgument5,
                                                         const GALGAS_routineDeclarationList constinArgument6,
                                                         const GALGAS_ramDefinitionList constinArgument7,
                                                         GALGAS_string & outArgument8,
                                                         GALGAS_piccoloDeviceModel & outArgument9,
                                                         GALGAS_uint & outArgument10,
                                                         GALGAS_ramBankTable & outArgument11,
                                                         GALGAS_registerTable & outArgument12,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
